In [3]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [5]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [6]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [12]:
def decade_(year):
    y = int(year/10)*10
    return y

In [13]:
titles2 = titles.copy()

In [14]:
titles2["decades"] = titles2["year"].apply(decade_)

In [27]:
titles2[["title","decades"]].groupby("decades").count()

         title
decades
1890         3
1900        37
1910      6512
1920      8797
1930     10097
1940      8576
1950     12711
1960     17515
1970     18714
1980     20243
1990     22225
2000     38713
2010     67977
2020       210

### Use groupby() count the number of "Hamlet" films made in each decade.

In [34]:
hamlets = titles2[titles2["title"].str.contains("Hamlet")]
hamlets[["title","decades"]].groupby("decades").count()

         title
decades
1910         4
1920         2
1930         1
1940         1
1950         1
1960         3
1970         4
1980         3
1990         6
2000        13
2010        16

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [39]:
n1 = cast[cast["n"]==1]
actors_n1 = n1[n1["type"]=="actor"]
actress_n1 = n1[n1["type"]=="actress"]

In [40]:
actors_n1[["type","n"]].groupby("n").count()

       type
n
1.0  102199

In [41]:
actress_n1[["type","n"]].groupby("n").count()

      type
n
1.0  45614

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [48]:
y1950 = cast[cast["year"]==1950]
n1to5 = y1950[y1950["n"].between(1,5)]
n1to5

,title,year,name,type,character,n
270,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0
1887,Abbott and Costello in the Foreign Legion,1950,Bud Abbott,actor,Bud Jones,1.0
2044,Sideshow,1950,John Abbott,actor,Pierre,3.0
5107,Sargam,1950,David (II) Abraham,actor,Pandit Shiv Shanker,4.0
6124,Alitet ukhodit v gory,1950,Andrei Abrikosov,actor,Nikita Sergeevich Los,1.0
...,...,...,...,...,...,...
3633677,Amor salvaje,1950,Dalia ??iguez,actress,Antonia,3.0
3633679,El desalmado,1950,Dalia ??iguez,actress,"Do?a Mar?a, madre de Vidal",4.0
3633686,La vida en broma,1950,Dalia ??iguez,actress,Rebeca Mata,4.0
3633691,Quinto patio,1950,Dalia ??iguez,actress,Do?a Blanquita Z??iga de Vallarta,5.0
3634392,Akdeniz korsanlari,1950,Muazzez ?lkerer,actress,Maria,2.0

In [50]:
actors_n1to5 = n1to5[n1to5["type"]=="actor"]
actress_n1to5 = n1to5[n1to5["type"]=="actress"]

,title,year,name,type,character,n
270,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0
1887,Abbott and Costello in the Foreign Legion,1950,Bud Abbott,actor,Bud Jones,1.0
2044,Sideshow,1950,John Abbott,actor,Pierre,3.0
5107,Sargam,1950,David (II) Abraham,actor,Pandit Shiv Shanker,4.0
6124,Alitet ukhodit v gory,1950,Andrei Abrikosov,actor,Nikita Sergeevich Los,1.0
...,...,...,...,...,...,...
2433809,Akdeniz korsanlari,1950,Daver Y?ken,actor,Davut,1.0
2447777,T' arravoniasmata,1950,Andreas Zisimatos,actor,Lenas,5.0
2448006,Crveni cvet,1950,Milivoje Zivanovic,actor,General Mitrovic,2.0
2448007,Cudotvorni mac,1950,Milivoje Zivanovic,actor,Bas-Celik,3.0
2448009,Jezero,1950,Milivoje Zivanovic,actor,Petar,1.0

In [51]:
actors_n1to5[["type","n"]].groupby("n").count()

     type
n
1.0   626
2.0   437
3.0   506
4.0   533
5.0   557

In [52]:
actress_n1to5[["type","n"]].groupby("n").count()

     type
n
1.0   281
2.0   415
3.0   315
4.0   270
5.0   226

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [57]:
pinkpanther = cast[cast["title"].str.contains("Pink Panther")]
pinkpanther[["title","character"]].groupby("title").count()

                                character
title
Curse of the Pink Panther              67
Revenge of the Pink Panther            64
Son of the Pink Panther                46
The Pink Panther                      111
The Pink Panther 2                     84
The Pink Panther Strikes Again         68
The Return of the Pink Panther         30
Trail of the Pink Panther              41

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [97]:
frankoz = cast[cast["name"]=="Frank Oz"]
#stuck

### List each of the characters that Frank Oz has portrayed at least twice.